tutorials/multiphase/interPorousFoam/mangroves/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Mangroves
{
    type            mangrovesSource;

    turbulence      on;

    regions
    {
        region1
        {
            cellZone        c0;
            a               0.01;
            N               560;
            Ckp        	    1;
            Cep         	3.5;
            Cm        	    1;
            Cd              1.52;
        }
    }
}


// ************************************************************************* //
