tutorials/multiphase/interPorousFoam/mangroves/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volScalarFieldValue MangrovesIndex 0
    volVectorFieldValue U (0 0 0)
);

regions
(
    boxToCell
    {
        box (-10 -10 -10) (100 100 0.15);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }

    surfaceToCell
    {
        file            "./constant/triSurface/seaweed.stl";
        outsidePoints   ((2 0.25 0.15));   
        includeCut      true;              
        includeInside   true;             
        includeOutside  false;              
        nearDistance    -1;                 
                                            
        curvature       -100;               
                                                                                     
        fieldValues
        (
            volScalarFieldValue MangrovesIndex 1
        );
    }
);


// ************************************************************************* //
